testes/jmeter.log
2025-08-22 17:11:32,603 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-08-22 17:11:32,635 INFO o.a.j.JMeter: Loading user properties from: /home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3/bin/user.properties
2025-08-22 17:11:32,636 INFO o.a.j.JMeter: Loading system properties from: /home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3/bin/system.properties
2025-08-22 17:11:32,636 INFO o.a.j.JMeter: Setting JMeter property: csvDataFile=/home/gercom/rede_recurso/besu-production-docker/testes/jmeter_runs_5_users/open_accounts.csv
2025-08-22 17:11:32,637 INFO o.a.j.JMeter: Setting JMeter property: apiHost=10.126.1.249
2025-08-22 17:11:32,646 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-08-22 17:11:32,646 INFO o.a.j.JMeter: Version 5.6.3
2025-08-22 17:11:32,646 INFO o.a.j.JMeter: java.version=21.0.7
2025-08-22 17:11:32,646 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-08-22 17:11:32,646 INFO o.a.j.JMeter: os.name=Linux
2025-08-22 17:11:32,647 INFO o.a.j.JMeter: os.arch=amd64
2025-08-22 17:11:32,647 INFO o.a.j.JMeter: os.version=6.8.0-71-generic
2025-08-22 17:11:32,647 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-08-22 17:11:32,647 INFO o.a.j.JMeter: java.awt.headless=true
2025-08-22 17:11:32,647 INFO o.a.j.JMeter: Max memory     =1073741824
2025-08-22 17:11:32,648 INFO o.a.j.JMeter: Available Processors =8
2025-08-22 17:11:32,663 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-08-22 17:11:32,664 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-08-22 17:11:32,664 INFO o.a.j.JMeter: JMeterHome=/home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3
2025-08-22 17:11:32,664 INFO o.a.j.JMeter: user.dir  =/home/gercom/rede_recurso/besu-production-docker/testes
2025-08-22 17:11:32,664 INFO o.a.j.JMeter: PWD       =/home/gercom/rede_recurso/besu-production-docker/testes
2025-08-22 17:11:32,665 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: gercom FullName: gercom
2025-08-22 17:11:32,691 INFO o.a.j.s.FileServer: Default base='/home/gercom/rede_recurso/besu-production-docker/testes'
2025-08-22 17:11:32,694 INFO o.a.j.s.FileServer: Set new base='/home/gercom/rede_recurso/besu-production-docker/testes/5_Users/Jmeter'
2025-08-22 17:11:33,064 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-08-22 17:11:33,113 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-08-22 17:11:33,119 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-08-22 17:11:33,126 INFO o.a.j.s.SaveService: Loading file: 5_Users/Jmeter/test_round1_open.jmx
2025-08-22 17:11:33,232 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-22 17:11:33,233 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-22 17:11:33,233 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-22 17:11:33,233 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-22 17:11:33,233 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-08-22 17:11:33,233 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-08-22 17:11:33,254 INFO o.a.j.JMeter: Creating summariser <summary>
2025-08-22 17:11:33,286 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-08-22 17:11:33,287 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-08-22 17:11:33,287 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-08-22 17:11:33,295 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-08-22 17:11:33,295 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-08-22 17:11:33,423 INFO o.a.j.JMeter: Running test (1755882693422)
2025-08-22 17:11:33,455 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Round 1: Open
2025-08-22 17:11:33,456 INFO o.a.j.e.StandardJMeterEngine: Starting 100 threads for group Round 1: Open.
2025-08-22 17:11:33,456 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-08-22 17:11:33,456 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=100 ramp-up=500 delayedStart=false
2025-08-22 17:11:33,566 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-08-22 17:11:33,566 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-08-22 17:11:33,617 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-1
2025-08-22 17:11:33,620 INFO o.a.j.s.FileServer: Stored: /home/gercom/rede_recurso/besu-production-docker/testes/jmeter_runs_5_users/open_accounts.csv
2025-08-22 17:11:33,679 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = gercom
2025-08-22 17:11:33,690 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-08-22 17:11:33,692 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-08-22 17:11:33,693 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-08-22 17:11:33,693 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-08-22 17:11:33,693 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-08-22 17:11:33,944 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    1.9/s Avg:   140 Min:   140 Max:   140 Err:     1 (100.00%) Active: 1 Started: 1 Finished: 0
2025-08-22 17:11:38,603 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-2
2025-08-22 17:11:43,606 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-3
2025-08-22 17:11:48,609 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-4
2025-08-22 17:11:48,944 INFO o.a.j.t.JMeterThread: Thread is done: Round 1: Open 1-1
2025-08-22 17:11:48,944 INFO o.a.j.t.JMeterThread: Thread finished: Round 1: Open 1-1
2025-08-22 17:11:53,603 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-5
2025-08-22 17:11:53,773 INFO o.a.j.t.JMeterThread: Thread is done: Round 1: Open 1-2
2025-08-22 17:11:53,773 INFO o.a.j.t.JMeterThread: Thread finished: Round 1: Open 1-2
2025-08-22 17:11:58,477 INFO o.a.j.t.JMeterThread: Thread is done: Round 1: Open 1-3
2025-08-22 17:11:58,477 INFO o.a.j.t.JMeterThread: Thread finished: Round 1: Open 1-3
2025-08-22 17:11:58,596 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-6
2025-08-22 17:12:00,015 INFO o.a.j.r.Summariser: summary +    853 in 00:00:26 =   32.7/s Avg:    74 Min:    48 Max:   233 Err:   853 (100.00%) Active: 3 Started: 6 Finished: 3
2025-08-22 17:12:00,016 INFO o.a.j.r.Summariser: summary =    854 in 00:00:27 =   32.1/s Avg:    74 Min:    48 Max:   233 Err:   854 (100.00%)
2025-08-22 17:12:03,599 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-7
2025-08-22 17:12:03,665 INFO o.a.j.t.JMeterThread: Thread is done: Round 1: Open 1-4
2025-08-22 17:12:03,665 INFO o.a.j.t.JMeterThread: Thread finished: Round 1: Open 1-4
2025-08-22 17:12:08,406 INFO o.a.j.r.ResultCollector: Shutdown hook started
2025-08-22 17:12:08,407 INFO o.a.j.r.ResultCollector: Shutdown hook ended