testes/jmeter.log
2025-10-20 11:40:18,848 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-10-20 11:40:18,881 INFO o.a.j.JMeter: Loading user properties from: /home/gercom/Besu/besu-production-docker/testes/apache-jmeter-5.6.3/bin/user.properties
2025-10-20 11:40:18,881 INFO o.a.j.JMeter: Loading system properties from: /home/gercom/Besu/besu-production-docker/testes/apache-jmeter-5.6.3/bin/system.properties
2025-10-20 11:40:18,882 INFO o.a.j.JMeter: Setting JMeter property: csvDataFile=/home/gercom/Besu/besu-production-docker/testes/jmeter_runs_5_users/transfer_accounts.csv
2025-10-20 11:40:18,882 INFO o.a.j.JMeter: Setting JMeter property: apiHost=10.126.1.249
2025-10-20 11:40:18,891 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-10-20 11:40:18,891 INFO o.a.j.JMeter: Version 5.6.3
2025-10-20 11:40:18,892 INFO o.a.j.JMeter: java.version=21.0.7
2025-10-20 11:40:18,892 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-10-20 11:40:18,892 INFO o.a.j.JMeter: os.name=Linux
2025-10-20 11:40:18,892 INFO o.a.j.JMeter: os.arch=amd64
2025-10-20 11:40:18,892 INFO o.a.j.JMeter: os.version=6.8.0-85-generic
2025-10-20 11:40:18,892 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-10-20 11:40:18,893 INFO o.a.j.JMeter: java.awt.headless=true
2025-10-20 11:40:18,893 INFO o.a.j.JMeter: Max memory     =1073741824
2025-10-20 11:40:18,893 INFO o.a.j.JMeter: Available Processors =8
2025-10-20 11:40:18,911 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-10-20 11:40:18,911 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-10-20 11:40:18,911 INFO o.a.j.JMeter: JMeterHome=/home/gercom/Besu/besu-production-docker/testes/apache-jmeter-5.6.3
2025-10-20 11:40:18,911 INFO o.a.j.JMeter: user.dir  =/home/gercom/Besu/besu-production-docker/testes
2025-10-20 11:40:18,912 INFO o.a.j.JMeter: PWD       =/home/gercom/Besu/besu-production-docker/testes
2025-10-20 11:40:18,912 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: gercom FullName: gercom
2025-10-20 11:40:18,937 INFO o.a.j.s.FileServer: Default base='/home/gercom/Besu/besu-production-docker/testes'
2025-10-20 11:40:18,940 INFO o.a.j.s.FileServer: Set new base='/home/gercom/Besu/besu-production-docker/testes/5_Users/Jmeter'
2025-10-20 11:40:19,364 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-10-20 11:40:19,416 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-10-20 11:40:19,422 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-10-20 11:40:19,429 INFO o.a.j.s.SaveService: Loading file: 5_Users/Jmeter/test_round3_transfer.jmx
2025-10-20 11:40:19,547 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-20 11:40:19,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-20 11:40:19,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-20 11:40:19,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-20 11:40:19,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-10-20 11:40:19,549 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-10-20 11:40:19,572 INFO o.a.j.JMeter: Creating summariser <summary>
2025-10-20 11:40:19,606 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-10-20 11:40:19,608 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-20 11:40:19,608 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-20 11:40:19,615 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-10-20 11:40:19,615 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-10-20 11:40:19,745 INFO o.a.j.JMeter: Running test (1760960419744)
2025-10-20 11:40:19,781 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Round 3: Transfer
2025-10-20 11:40:19,782 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Round 3: Transfer.
2025-10-20 11:40:19,782 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-10-20 11:40:19,782 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=0 delayedStart=false
2025-10-20 11:40:19,794 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-10-20 11:40:19,794 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-10-20 11:40:19,877 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-2
2025-10-20 11:40:19,877 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-3
2025-10-20 11:40:19,877 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-5
2025-10-20 11:40:19,877 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-4
2025-10-20 11:40:19,877 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-1
2025-10-20 11:40:19,880 INFO o.a.j.s.FileServer: Stored: /home/gercom/Besu/besu-production-docker/testes/jmeter_runs_5_users/transfer_accounts.csv
2025-10-20 11:40:19,928 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = gercom
2025-10-20 11:40:19,939 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-10-20 11:40:19,941 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-10-20 11:40:19,941 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-10-20 11:40:19,942 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-10-20 11:40:19,942 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-10-20 11:40:20,184 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-4
2025-10-20 11:40:20,184 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-4
2025-10-20 11:40:20,195 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-3
2025-10-20 11:40:20,195 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-3
2025-10-20 11:40:20,200 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-5
2025-10-20 11:40:20,201 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-5
2025-10-20 11:40:20,202 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-2
2025-10-20 11:40:20,202 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-2
2025-10-20 11:40:20,204 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-1
2025-10-20 11:40:20,205 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-1
2025-10-20 11:40:20,205 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-10-20 11:40:20,205 INFO o.a.j.s.FileServer: Close: /home/gercom/Besu/besu-production-docker/testes/jmeter_runs_5_users/transfer_accounts.csv
2025-10-20 11:40:20,212 INFO o.a.j.r.Summariser: summary =     50 in 00:00:00 =  107.3/s Avg:    11 Min:     2 Max:    72 Err:     0 (0.00%)