testes/jmeter.log
2025-07-30 20:33:19,102 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-07-30 20:33:19,134 INFO o.a.j.JMeter: Loading user properties from: /home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3/bin/user.properties
2025-07-30 20:33:19,134 INFO o.a.j.JMeter: Loading system properties from: /home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3/bin/system.properties
2025-07-30 20:33:19,135 INFO o.a.j.JMeter: Setting JMeter property: contractAddress=0xf6c9fdf6d0ECaB2d7C35F3dA92ae77ec6578381F
2025-07-30 20:33:19,135 INFO o.a.j.JMeter: Setting JMeter property: accountCsvPath=/home/gercom/rede_recurso/besu-production-docker/testes/ethereum_accounts.csv
2025-07-30 20:33:19,143 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-07-30 20:33:19,144 INFO o.a.j.JMeter: Version 5.6.3
2025-07-30 20:33:19,144 INFO o.a.j.JMeter: java.version=21.0.7
2025-07-30 20:33:19,144 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-07-30 20:33:19,144 INFO o.a.j.JMeter: os.name=Linux
2025-07-30 20:33:19,144 INFO o.a.j.JMeter: os.arch=amd64
2025-07-30 20:33:19,144 INFO o.a.j.JMeter: os.version=6.8.0-64-generic
2025-07-30 20:33:19,145 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-07-30 20:33:19,145 INFO o.a.j.JMeter: java.awt.headless=true
2025-07-30 20:33:19,145 INFO o.a.j.JMeter: Max memory     =1073741824
2025-07-30 20:33:19,145 INFO o.a.j.JMeter: Available Processors =8
2025-07-30 20:33:19,160 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-07-30 20:33:19,160 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-07-30 20:33:19,161 INFO o.a.j.JMeter: JMeterHome=/home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3
2025-07-30 20:33:19,161 INFO o.a.j.JMeter: user.dir  =/home/gercom/rede_recurso/besu-production-docker/testes
2025-07-30 20:33:19,161 INFO o.a.j.JMeter: PWD       =/home/gercom/rede_recurso/besu-production-docker/testes
2025-07-30 20:33:19,162 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: gercom FullName: gercom
2025-07-30 20:33:19,187 INFO o.a.j.s.FileServer: Default base='/home/gercom/rede_recurso/besu-production-docker/testes'
2025-07-30 20:33:19,189 INFO o.a.j.s.FileServer: Set new base='/home/gercom/rede_recurso/besu-production-docker/testes'
2025-07-30 20:33:19,547 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-07-30 20:33:19,593 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-07-30 20:33:19,598 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-07-30 20:33:19,604 INFO o.a.j.s.SaveService: Loading file: test_round3_transfer.jmx
2025-07-30 20:33:19,699 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-30 20:33:19,699 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-30 20:33:19,700 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-30 20:33:19,700 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-30 20:33:19,700 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-07-30 20:33:19,700 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-07-30 20:33:19,734 INFO o.a.j.JMeter: Creating summariser <summary>
2025-07-30 20:33:19,766 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-07-30 20:33:19,767 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-30 20:33:19,767 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-30 20:33:19,776 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-07-30 20:33:19,776 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-07-30 20:33:19,900 INFO o.a.j.JMeter: Running test (1753907599900)
2025-07-30 20:33:19,934 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Round 3: Transfer
2025-07-30 20:33:19,935 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Round 3: Transfer.
2025-07-30 20:33:19,935 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-07-30 20:33:19,935 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=1 delayedStart=false
2025-07-30 20:33:19,948 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-07-30 20:33:19,948 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-07-30 20:33:20,022 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-1
2025-07-30 20:33:20,025 INFO o.a.j.s.FileServer: Stored: /home/gercom/rede_recurso/besu-production-docker/testes/ethereum_accounts.csv
2025-07-30 20:33:20,088 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = gercom
2025-07-30 20:33:20,099 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-07-30 20:33:20,102 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-07-30 20:33:20,102 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-07-30 20:33:20,105 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-07-30 20:33:20,105 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-07-30 20:33:20,215 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-2
2025-07-30 20:33:20,414 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-3
2025-07-30 20:33:20,613 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-4
2025-07-30 20:33:20,812 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-5
2025-07-30 20:33:28,061 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-1
2025-07-30 20:33:28,062 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-1
2025-07-30 20:33:28,420 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-2
2025-07-30 20:33:28,420 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-2
2025-07-30 20:33:29,026 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-3
2025-07-30 20:33:29,026 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-3
2025-07-30 20:33:29,221 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-4
2025-07-30 20:33:29,222 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-4
2025-07-30 20:33:29,416 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-5
2025-07-30 20:33:29,416 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-5
2025-07-30 20:33:29,417 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-07-30 20:33:29,418 INFO o.a.j.s.FileServer: Close: /home/gercom/rede_recurso/besu-production-docker/testes/ethereum_accounts.csv
2025-07-30 20:33:29,422 INFO o.a.j.r.Summariser: summary =     50 in 00:00:10 =    5.3/s Avg:     5 Min:     1 Max:    62 Err:     0 (0.00%)